---
kind: method
id: M:Autodesk.Revit.DB.ScheduleSortGroupField.Dispose
source: html/d9428323-2de7-59dd-ba60-4352addceec3.htm
---
# Autodesk.Revit.DB.ScheduleSortGroupField.Dispose Method

Releases all resources used by the ScheduleSortGroupField

## Syntax (C#)
```csharp
public void Dispose()
```